UT_Marketplaces.Marketplaces/src/InformationRegisters/РегистрацияТСД/РегистрацияТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацияТСД</name>
  <resources>
    <name>ВерсияМП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоОбращения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>IDТСД</name>
    <type>
      <types>CatalogRef.IDТСД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/СтатусыРегистрацийТСД/СтатусыРегистрацийТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыРегистрацийТСД</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРегистрацийТСД</types>
    </type>
  </resources>
  <resources>
    <name>ЛицензионныйКлючЛицензированиеТСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Enums/СтатусыРегистрацийТСД/СтатусыРегистрацийТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРегистрацийТСД</name>
  <enumValues>
    <name>ОтправленаНаРегистрацию</name>
  </enumValues>
  <enumValues>
    <name>ЛицензияПолучена</name>
  </enumValues>
  <enumValues>
    <name>ЛицензияЗаканчивается</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/CommonForms/ЗарегистрироватьЛицензированиеТСД/Module.bsl
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаРегистрацию(Команда)
	ОтправитьНаРегистрациюНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЛицензию(Команда)
	ПолучитьЛицензиюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеВФайл(Команда)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;   
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	
	ДиалогОткрытия.Каталог = ""; 
	
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	
	Если ДиалогОткрытия.Выбрать() Тогда 
		
		ПутьККаталогу = ДиалогОткрытия.Каталог; 
		
	КонецЕсли; 
	
	Если ПроверитьЗаполнениеОрганизацииИПочты() Тогда
		
		ТекстовыйФайл = Новый ТекстовыйДокумент;
		
		ТекстовыйФайл.ДобавитьСтроку(ИНН + "/" + Организация + "/" + Email);
		
		СписокIDТСД = ПолучитьСписокIDТСД();		
		
		Для Каждого Стр Из СписокIDТСД Цикл 
			
			ТекстовыйФайл.ДобавитьСтроку(Строка(Стр) + "//"); 
			
		КонецЦикла;
		
		Если ПутьККаталогу <> Неопределено Тогда
			
			ТекстовыйФайл.Записать(
			ПутьККаталогу + "\ДанныеДляРегистрацииТСД.txt",        
			КодировкаТекста.UTF8, 
			Символы.ВК + Символы.ПС
			);
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Данные для регистрации ТСД успешно сохранены в файл";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьСписокIDТСД()
	
	СписокIDТСД = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрацияТСД.IDТСД КАК IDТСД
		|ИЗ
		|	РегистрСведений.РегистрацияТСД КАК РегистрацияТСД";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокIDТСД.Добавить(ВыборкаДетальныеЗаписи.IDТСД);	
	КонецЦикла;
	
	Возврат СписокIDТСД;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОффлайнРегистрацию(Команда)
	ПоказатьОффлайнРегистрациюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаПеререгистрацию(Команда)
	ОтправитьНаПеререгистрациюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИдентификацонныеНомера(Команда)
	
	ОбновитьИдентификацонныеНомераНаСервере();  
	//После удаления ТСД обновим список ТСД и подключим обновление в фоне для новых ТСД
	Элементы.IDТСД.Обновить(); 
	ПодключитьОбработчикОжидания("ОбновитьСписокТСДвФоне", 60); 
	
	Элементы.ОтправитьНаПеререгистрацию.Видимость = Истина;
	Элементы.ОтправитьНаРегистрацию.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеОрганизацииИПочты()
	
	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		
		Сообщить("Пожалуйста заполните реквизит Организация");	
		
		Возврат Ложь;
		
	КонецЕсли;	
	
	Если СтрНайти(Email,"@") = 0 Или СтрНайти(Email,".") = 0 Тогда
		
		Сообщить("Необходимо ввести правильный адрес электронной почты");
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;  
	
КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ИНН = Организация.ИНН;
	Email = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОрганизацииКонтактнаяИнформация.АдресЭП КАК АдресЭП
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Ссылка = &Ссылка
	|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	
	Запрос.УстановитьПараметр("Ссылка", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Результат = РезультатЗапроса.Выгрузить();
		Email = Результат[0].АдресЭП;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаРегистрациюНаСервере()
	
	Если ПроверитьЗаполнениеОрганизацииИПочты() Тогда
		
		Результат = ОбменДаннымиЛицензированиеТСД.ОтправитьНаРегистрацию(ПолучитьРегДанныеОрганизации());
		
		Элементы.СтраницаВыбора.Видимость = Ложь; 
		Элементы.СтраницаРегистрации.Видимость = Ложь;
		Элементы.СтраницаПеререгистрации.Видимость = Ложь;
		Элементы.СтраницаБезДоступаКСети.Видимость = Ложь;
		Элементы.СтраницаОтветаСервера.Видимость = Истина;
		
		Если Результат.Успешно Тогда
			
			Элементы.Успешно.Видимость = Истина;
			
			Элементы.НадписьУспешныйОтвет.Заголовок = "Данные для регистрации лицензии успешно отправлены!";   
			
			ЗаписатьСтатусРегистрацииТСД(0);
			
		Иначе    
			
			Элементы.Ошибка.Видимость = Истина;
			
			Элементы.НадписьУспешныйОтвет.Заголовок = "Данные для регистрации лицензии не отправлены!";
			
		КонецЕсли;    
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЛицензиюНаСервере()
	
	Если ПроверитьЗаполнениеОрганизацииИПочты() Тогда
		
		РегДанные = Новый Структура;
		
		РегДанные.Вставить("Организация",Организация.Наименование); 
		
		Результат = ОбменДаннымиЛицензированиеТСД.ПолучитьЛицензию(РегДанные); 
		
		Элементы.СтраницаВыбора.Видимость = Ложь; 
		Элементы.СтраницаРегистрации.Видимость = Ложь;
		Элементы.СтраницаПеререгистрации.Видимость = Ложь;
		Элементы.СтраницаБезДоступаКСети.Видимость = Ложь;
		Элементы.СтраницаОтветаСервера.Видимость = Истина;
		
		Если Результат.Успешно Тогда 
			
			Элементы.Успешно.Видимость = Истина;    
			
			ЗаписатьСтатусРегистрацииТСД(1,Результат.ЛицензионныйКлюч); 
									
			Элементы.НадписьУспешныйОтвет.Заголовок = "Лицензионный ключ успешно получен";
			
		Иначе
			
			Элементы.Ошибка.Видимость = Истина;
			
			Элементы.НадписьУспешныйОтвет.Заголовок = "Лицензионный ключ для выбранной организации отсутсвует, пожалуйста свяжитесь с компанией 1С-Рарус";
			
		КонецЕсли;    
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаПеререгистрациюНаСервере()
	
	Если ПроверитьЗаполнениеОрганизацииИПочты() Тогда  
		
		Результат = ОбменДаннымиЛицензированиеТСД.ОтправитьНаПеререгистрацию(ПолучитьРегДанныеОрганизации());
		
		Элементы.СтраницаВыбора.Видимость = Ложь; 
		Элементы.СтраницаРегистрации.Видимость = Ложь;
		Элементы.СтраницаПеререгистрации.Видимость = Ложь;
		Элементы.СтраницаБезДоступаКСети.Видимость = Ложь;
		Элементы.СтраницаОтветаСервера.Видимость = Истина;
		
		Если Результат.Успешно Тогда 
			
			Элементы.Успешно.Видимость = Истина;
			
			Элементы.НадписьУспешныйОтвет.Заголовок = "Регистрационные данные успешно обновлены";     
						
		Иначе
			
			Элементы.Ошибка.Видимость = Истина;
			
			Элементы.НадписьУспешныйОтвет.Заголовок = "Регистрационные данные не обновлены";
			
		КонецЕсли;  
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИдентификацонныеНомераНаСервере()

	ОтправитьУведомления();
	УдалитьСуществующиеТСД();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОффлайнРегистрациюНаСервере()

	Элементы.СтраницаРегистрации.Видимость = Ложь;
	Элементы.СтраницаПеререгистрации.Видимость = Ложь;
	Элементы.СтраницаБезДоступаКСети.Видимость = Истина;
	
КонецПроцедуры  

&НаСервере
Процедура ОтправитьУведомления()

	Идентификаторы = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	IDТСД.ИдентификаторПодписчика КАК ИдентификаторПодписчика
	|ИЗ
	|	Справочник.IDТСД КАК IDТСД";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Идентификаторы.Добавить(ВыборкаДетальныеЗаписи.ИдентификаторПодписчика);
	КонецЦикла;
	
	РегДанные = Новый Структура;
	РегДанные.Вставить("Идентификаторы",Идентификаторы);
	
	ОбменДаннымиЛицензированиеТСД.ОтправитьУведомленияНаТСДСерверЛицензирования(РегДанные);	

КонецПроцедуры

&НаСервере 
Процедура УдалитьСуществующиеТСД()

	//Очищаем записи регистра сведений
	Набор = РегистрыСведений.РегистрацияТСД.СоздатьНаборЗаписей();
	Набор.Записать();    
	
	//Очищаем справочник ТСД
	Выборка = Справочники.IDТСД.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбъектСправочника = Выборка.ПолучитьОбъект();
		ОбъектСправочника.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокТСДвФоне()
	Элементы.IDТСД.Обновить(); 
КонецПроцедуры

&НаСервере
Функция ПолучитьРегДанныеОрганизации()

	РегДанные = Новый Структура;
	
	РегДанные.Вставить("ИНН",ИНН);
	РегДанные.Вставить("Организация",Организация.Наименование); 
	РегДанные.Вставить("Email",Email);
	
	СтрокаIDТСД = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрацияТСД.IDТСД КАК IDТСД
	|ИЗ
	|	РегистрСведений.РегистрацияТСД КАК РегистрацияТСД";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если СтрокаIDТСД = "" Тогда
			СтрокаIDТСД = СтрокаIDТСД + ВыборкаДетальныеЗаписи.IDТСД;
		Иначе
			СтрокаIDТСД = СтрокаIDТСД + "//" + ВыборкаДетальныеЗаписи.IDТСД;
		КонецЕсли;
		
	КонецЦикла;
	
	РегДанные.Вставить("IDТСД",СтрокаIDТСД);
	
	Возврат РегДанные; 
		
КонецФункции

&НаСервере
Процедура ПоказатьСтраницуРегистрацииНаСервере()
	
	Элементы.СтраницаВыбора.Видимость = Ложь;  
	Элементы.СтраницаПеререгистрации.Видимость = Ложь;
	Элементы.СтраницаРегистрации.Видимость = Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуРегистрации(Команда)
	ПоказатьСтраницуРегистрацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоказатьСтраницуПеререгистрацииНаСервере()
	
	Элементы.СтраницаВыбора.Видимость = Ложь; 
	Элементы.СтраницаРегистрации.Видимость = Ложь;
	Элементы.СтраницаПеререгистрации.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуПеререгистрации(Команда)
	ПоказатьСтраницуПеререгистрацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСтатусРегистрацииТСД(Статус,ЛицензионныйКлюч = "")   
	
	НаборЗаписей = РегистрыСведений.СтатусыРегистрацийТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.ЛицензионныйКлючЛицензированиеТСД = ЛицензионныйКлюч;
		НоваяЗапись.Статус = ?(Статус = 0, 
								Перечисления.СтатусыРегистрацийТСД.ОтправленаНаРегистрацию,
								Перечисления.СтатусыРегистрацийТСД.ЛицензияПолучена);	
	Иначе	
		НаборЗаписей[0].ЛицензионныйКлючЛицензированиеТСД = ЛицензионныйКлюч;
		НаборЗаписей[0].Статус = ?(Статус = 0, 
								Перечисления.СтатусыРегистрацийТСД.ОтправленаНаРегистрацию,
								Перечисления.СтатусыРегистрацийТСД.ЛицензияПолучена);			
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЛицензионныйКлючИзФайла(Команда)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	ДиалогВыбора.Заголовок = "Выберите файл";
	ДиалогВыбора.Фильтр = "Текст(*.txt)|*.txt";	
	ДиалогВыбора.МножественныйВыбор=Ложь;
	
	Если ДиалогВыбора.Выбрать() Тогда
		
		ИмяФайла = ДиалогВыбора.ПолноеИмяФайла;
		
	КонецЕсли; 
	
	Текст = Новый ЧтениеТекста(ИмяФайла);	
	Строка = Текст.ПрочитатьСтроку();
	
	Если Строка <> Неопределено Тогда
		ЗаписатьСтатусРегистрацииТСД(1,Строка);
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Лицензия для организации " + Организация + " успешно получена";
		Сообщение.Сообщить(); 
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Лицензионный ключ отсутствует в выбранном файле";
		Сообщение.Сообщить();
	КонецЕсли;   
	
КонецПроцедуры
